#!/bin/bash


# Определение переменных 
NOW=$(date +"%d-%m-%Y %T")                                                                       # Дата старта  $(date +"%d-%m-%Y %T %A") %A - День недели по английски
EMAIL="user@you.com"                                                                             # Адрес отсылки куда
FROM="ho@ho.com.ua"                                                                              # От кого послано сообщение
LOGFL="log.txt"                                                                                  # Имя файла для логирования операций
BAKFL="db.tar"                                                                                   # Имя архивного файла после архивации
NOTIF="Cообщение отправлено на почту."                                                           # Сообщение для лог опреаций 
## FTPPT="ftp://user:123456789@10.10.10.10/homes/user/back/"                                     # Адрес получения архива
ARCHP="/var/lib/rethinkdb/instance1/data"                                                        # Путь от куда будет копироваться информация
SEPAR="**************************************************************************************"   # Разделитель в лог файле


# Начало операции
echo " ">>$LOGFL
echo "$SEPAR">>$LOGFL
echo "$NOW  Старт расчета.">>$LOGFL

## Расчет потребности
## 10 - количество дней анализа (глубина анализа)
curl -XPOST http://service.com.ua:5555/procedure/calcal/100

NOWA=$(date +"%d-%m-%Y %T")

echo -e "$NOWA   Окончание расчета потребности." >> $LOGFL
echo -e "Окончание расчета потребности. \nСтарт: $NOW \nФиниш: $NOWA" | mail -s "Расчет потребности закончен." -r $FROM $EMAIL

NOWA=$(date +"%d-%m-%Y %T")

echo -e "$NOVA  $NOTIF" >> $LOGFL
echo "$SEPAR" >> $LOGFL
